Конфигурация/src/BusinessProcesses/СогласованиеРасписания/СогласованиеРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>СогласованиеРасписания</name>
  <task>Task.ЗадачаПользователя</task>
  <attributes>
    <name>ДокументРасписания</name>
    <type>
      <types>DocumentRef.ФормированиеРасписания</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

Конфигурация/src/BusinessProcesses/СогласованиеРасписания/ObjectModule.bsl
Процедура ПроверитьРасписаниеПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	
	Согласовано = Истина;

	Если НЕ ПустаяСтрока(СокрЛП(Строка(Задача.КомментарийИсполнителя))) Тогда
		Комментарий = Задача.КомментарийИсполнителя;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьРасписаниеПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл

		ФормируемаяЗадача.Исполнитель = Ответственный;
		ФормируемаяЗадача.Наименование = "Проверить расписание";
		ФормируемаяЗадача.ОписаниеЗадачи = "Проверить расписание";

		Если ЗначениеЗаполнено(ДокументРасписания) Тогда
			ФормируемаяЗадача.ОписаниеЗадачи = "Проверить расписание: " + Строка(ДокументРасписания);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры
